tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "thii/unxip"
# Java build tool
brew "ant"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db"
# Perl compatible regular expressions library
brew "pcre"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# ASP system to ground and solve logic programs
brew "clingo"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Filesystem for accessing FTP hosts based on FUSE and libcurl
brew "curlftpfs"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Modern replacement for 'ls'
brew "exa"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame", link: false
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# High-performance, high-quality MPEG-4 video library
brew "xvid", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU debugger
brew "gdb"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# HTTP/2 C Library
brew "nghttp2"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Next generation open source RPC library and framework
brew "grpc", link: false
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Implementation of the file(1) command
brew "libmagic"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Command-line client for Mega.co.nz
brew "megatools"
# Cross-platform application and UI framework
brew "qt"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Library like getopt(3) with a number of enhancements
brew "popt", link: false
# Python version management
brew "pyenv"
# GNU's portable shell tool
brew "shtool"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl", link: false
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# A Swift command line tool to extract signed archives
brew "thii/unxip/unxip"
# Android SDK component
cask "android-platform-tools"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
cask "font-fira-code"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Software for Logitech devices
cask "logitech-options"
# Remote desktop client
cask "microsoft-remote-desktop"
# App to write, plan, collaborate, and get organized
cask "notion"
# File system integration
cask "osxfuse"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# To-do & task list manager
cask "ticktick"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "iMovie", id: 408981434
mas "Keymou", id: 449863619
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Snappy", id: 512617038
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
