tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sidneys/homebrew"
tap "simonw/llm"
tap "stripe/stripe-cli"
tap "thii/unxip"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# ASP system to ground and solve logic programs
brew "clingo"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# .NET Core
brew "dotnet"
# Access and convert several ebook formats
brew "ebook-tools"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern replacement for 'ls'
brew "exa"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame", link: false
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Multi-format archive and compression library
brew "libarchive"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Optimized BLAS library
brew "openblas"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Framework for layout and rendering of i18n text
brew "pango"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# High-performance, high-quality MPEG-4 video library
brew "xvid", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library access to GnuPG
brew "gpgme"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Next generation open source RPC library and framework
brew "grpc"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Website copier/offline browser
brew "httrack"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Platform built on V8 to build network applications
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Implementation of the file(1) command
brew "libmagic"
# Bare libuv bindings for lua
brew "luv"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Command-line client for Mega.co.nz
brew "megatools"
# Cross-platform application and UI framework
brew "qt"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# FTP client with an advanced user interface
brew "ncftp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Library like getopt(3) with a number of enhancements
brew "popt", link: false
# Object-relational database system
brew "postgresql@14"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Ncurses BitTorrent client based on libtorrent-rakshasa
brew "rtorrent"
# GNU's portable shell tool
brew "shtool"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Fast Xcode unarchiver
brew "unxip"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Offline NT Password Editor
brew "sidneys/homebrew/chntpw"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Android SDK component
cask "android-platform-tools"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Guitar Hero clone
cask "clone-hero"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Free and open-source media player
cask "kodi"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Software for Logitech devices
cask "logitech-options"
# Web browser
cask "microsoft-edge"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Play PC games and connect with your friends
cask "origin"
# Connect MIDI and OSC Controllers
cask "osculator"
# GUI client for PostgreSQL databases
cask "postico"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# To-do & task list manager
cask "ticktick"
# Virtual machines UI using QEMU
cask "utm"
# Stream media from your computer to Chromecast
cask "videostream"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Email client
cask "zoho-mail"
mas "Authenticator", id: 1538761576
mas "FileZilla Pro", id: 1298486723
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keymou", id: 449863619
mas "Keynote", id: 409183694
mas "MonitorControlLite", id: 1595464182
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Server", id: 883878097
mas "Snappy", id: 512617038
mas "Spark", id: 1176895641
mas "Spark Desktop", id: 6445813049
mas "Xcode", id: 497799835
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
