tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "thii/unxip"
# Development kit for the Java programming language
brew "openjdk"
# Java build tool
brew "ant"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# High performance key/value database
brew "berkeley-db", link: true
# Collection of portable C++ source libraries
brew "boost"
# Perl compatible regular expressions library
brew "pcre"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# ASP system to ground and solve logic programs
brew "clingo"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Access and convert several ebook formats
brew "ebook-tools"
# Modern replacement for 'ls'
brew "exa"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane"
# Generic library support script
brew "libtool"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame", link: false
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# High-performance, high-quality MPEG-4 video library
brew "xvid", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# Network related modules for glib
brew "glib-networking"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Next generation open source RPC library and framework
brew "grpc"
# Website copier/offline browser
brew "httrack"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# Platform built on V8 to build network applications
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Implementation of the file(1) command
brew "libmagic"
# Bare libuv bindings for lua
brew "luv"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Command-line client for Mega.co.nz
brew "megatools"
# Cross-platform application and UI framework
brew "qt"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Open source relational database management system
brew "mysql"
# Node version management
brew "n"
# FTP client with an advanced user interface
brew "ncftp"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Library like getopt(3) with a number of enhancements
brew "popt", link: false
# Python version management
brew "pyenv"
# Tool Command Language
brew "tcl-tk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# GNU's portable shell tool
brew "shtool"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Android SDK component
cask "android-platform-tools"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Guitar Hero clone
cask "clone-hero"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerized applications and microservices
cask "docker"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Free and open-source media player
cask "kodi"
# Create, manage and debug system- and user services
cask "launchcontrol"
# Software for Logitech devices
cask "logitech-options"
# Remote desktop client
cask "microsoft-remote-desktop"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Connect MIDI and OSC Controllers
cask "osculator"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# To-do & task list manager
cask "ticktick"
# Virtual machines UI using QEMU
cask "utm"
# Stream media from your computer to Chromecast
cask "videostream"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Email client
cask "zoho-mail"
mas "Authenticator", id: 1538761576
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keymou", id: 449863619
mas "Keynote", id: 409183694
mas "MonitorControlLite", id: 1595464182
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Server", id: 883878097
mas "Snappy", id: 512617038
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
